In [2]:
import numpy as np
import pandas as pd

In [3]:
dic1={
    "name":['Anurag','Raunak','Mrunal'],
    "marks":[91,45,89],
    "city":['Mumbai','uttarpradesh','Manglore']
}

In [5]:
df=pd.DataFrame(dic1)

In [6]:
df

     name  marks          city
0  Anurag     91        Mumbai
1  Raunak     45  uttarpradesh
2  Mrunal     89      Manglore

In [7]:
df.to_csv("Friends.csv")

In [8]:
df.to_csv("Friends_no_index.csv",index=False)

In [9]:
df.head(2)#for starting two rows

     name  marks          city
0  Anurag     91        Mumbai
1  Raunak     45  uttarpradesh

In [10]:
df.tail(1)#for starting two rows

     name  marks      city
2  Mrunal     89  Manglore

In [11]:
df.describe()

       marks
count    3.0
mean    75.0
std     26.0
min     45.0
25%     67.0
50%     89.0
75%     90.0
max     91.0

In [12]:
Train=pd.read_csv('train.csv')#to read a csv file

In [13]:
Train

    Train No  Speed     City
0      19637     87   Mumbai
1      73924     83  Kolkata
2      91364     90    Delhi

In [15]:
Train['Speed'][1]=65

C:\Users\anura\AppData\Local\Temp/ipykernel_6380/1262343626.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Train['Speed'][1]=65

In [16]:
Train

    Train No  Speed     City
0      19637     87   Mumbai
1      73924     65  Kolkata
2      91364     90    Delhi

In [17]:
Train.to_csv('train.csv')#to change csv file

In [18]:
Train['Speed'][1]=695

C:\Users\anura\AppData\Local\Temp/ipykernel_6380/2582021470.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Train['Speed'][1]=695

In [20]:
Train.to_csv('train.csv')#to change csv file